Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking (Masking)            (None, 80, 6)             0         
_________________________________________________________________
lstm (LSTM)                  (None, 50)                11400     
_________________________________________________________________
dense (Dense)                (None, 16)                816       
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 12,233
Trainable params: 12,233
Non-trainable params: 0
_________________________________________________________________

Epoch 1/20
  1/157 [..............................] - ETA: 0s - loss: 0.6954  2/157 [..............................] - ETA: 7:13 - loss: 0.6942  3/157 [..............................] - ETA: 10:40 - loss: 0.6938  4/157 [..............................] - ETA: 12:27 - loss: 0.6932  5/157 [..............................] - ETA: 15:22 - loss: 0.6935  6/157 [>.............................] - ETA: 16:48 - loss: 0.6933  7/157 [>.............................] - ETA: 19:10 - loss: 0.6932  8/157 [>.............................] - ETA: 19:20 - loss: 0.6932  9/157 [>.............................] - ETA: 18:24 - loss: 0.6929 10/157 [>.............................] - ETA: 17:35 - loss: 0.6925 11/157 [=>............................] - ETA: 16:36 - loss: 0.6924 12/157 [=>............................] - ETA: 15:49 - loss: 0.6922 13/157 [=>............................] - ETA: 15:10 - loss: 0.6923 14/157 [=>............................] - ETA: 14:39 - loss: 0.6919 15/157 [=>............................] - ETA: 14:26 - loss: 0.6920 16/157 [==>...........................] - ETA: 14:19 - loss: 0.6919 17/157 [==>...........................] - ETA: 13:58 - loss: 0.6923 18/157 [==>...........................] - ETA: 13:24 - loss: 0.6923 19/157 [==>...........................] - ETA: 13:08 - loss: 0.6922 20/157 [==>...........................] - ETA: 13:12 - loss: 0.6918 21/157 [===>..........................] - ETA: 13:02 - loss: 0.6917 22/157 [===>..........................] - ETA: 12:47 - loss: 0.6915 23/157 [===>..........................] - ETA: 12:56 - loss: 0.6915 24/157 [===>..........................] - ETA: 12:47 - loss: 0.6912 25/157 [===>..........................] - ETA: 12:37 - loss: 0.6912 26/157 [===>..........................] - ETA: 12:23 - loss: 0.6911 27/157 [====>.........................] - ETA: 12:19 - loss: 0.6910 28/157 [====>.........................] - ETA: 12:33 - loss: 0.6909 29/157 [====>.........................] - ETA: 12:26 - loss: 0.6906 30/157 [====>.........................] - ETA: 12:27 - loss: 0.6906 31/157 [====>.........................] - ETA: 12:09 - loss: 0.6904 32/157 [=====>........................] - ETA: 11:57 - loss: 0.6901 33/157 [=====>........................] - ETA: 11:52 - loss: 0.6900 34/157 [=====>........................] - ETA: 11:41 - loss: 0.6895 35/157 [=====>........................] - ETA: 11:30 - loss: 0.6891 36/157 [=====>........................] - ETA: 11:23 - loss: 0.6890 37/157 [======>.......................] - ETA: 11:11 - loss: 0.6888 38/157 [======>.......................] - ETA: 11:01 - loss: 0.6885 39/157 [======>.......................] - ETA: 10:52 - loss: 0.6882 40/157 [======>.......................] - ETA: 10:40 - loss: 0.6878 41/157 [======>.......................] - ETA: 10:31 - loss: 0.6875 42/157 [=======>......................] - ETA: 10:18 - loss: 0.6872 43/157 [=======>......................] - ETA: 10:09 - loss: 0.6867 44/157 [=======>......................] - ETA: 9:58 - loss: 0.6865  45/157 [=======>......................] - ETA: 9:49 - loss: 0.6861 46/157 [=======>......................] - ETA: 9:42 - loss: 0.6859 47/157 [=======>......................] - ETA: 9:41 - loss: 0.6857 48/157 [========>.....................] - ETA: 9:37 - loss: 0.6854 49/157 [========>.....................] - ETA: 9:32 - loss: 0.6851 50/157 [========>.....................] - ETA: 9:26 - loss: 0.6849 51/157 [========>.....................] - ETA: 9:22 - loss: 0.6848 52/157 [========>.....................] - ETA: 9:19 - loss: 0.6848 53/157 [=========>....................] - ETA: 9:13 - loss: 0.6847 54/157 [=========>....................] - ETA: 9:13 - loss: 0.6846 55/157 [=========>....................] - ETA: 9:08 - loss: 0.6846 56/157 [=========>....................] - ETA: 9:04 - loss: 0.6845 57/157 [=========>....................] - ETA: 8:57 - loss: 0.6843 58/157 [==========>...................] - ETA: 8:49 - loss: 0.6842 59/157 [==========>...................] - ETA: 8:46 - loss: 0.6840 60/157 [==========>...................] - ETA: 8:43 - loss: 0.6840 61/157 [==========>...................] - ETA: 8:42 - loss: 0.6840 62/157 [==========>...................] - ETA: 8:40 - loss: 0.6838 63/157 [===========>..................] - ETA: 8:42 - loss: 0.6837 64/157 [===========>..................] - ETA: 8:43 - loss: 0.6837 65/157 [===========>..................] - ETA: 8:38 - loss: 0.6836 66/157 [===========>..................] - ETA: 8:31 - loss: 0.6835 67/157 [===========>..................] - ETA: 8:24 - loss: 0.6833 68/157 [===========>..................] - ETA: 8:26 - loss: 0.6833 69/157 [============>.................] - ETA: 8:25 - loss: 0.6833 70/157 [============>.................] - ETA: 8:31 - loss: 0.6832 71/157 [============>.................] - ETA: 8:38 - loss: 0.6832 72/157 [============>.................] - ETA: 8:31 - loss: 0.6831 73/157 [============>.................] - ETA: 8:24 - loss: 0.6830 74/157 [=============>................] - ETA: 8:17 - loss: 0.6830 75/157 [=============>................] - ETA: 8:10 - loss: 0.6829 76/157 [=============>................] - ETA: 8:02 - loss: 0.6827 77/157 [=============>................] - ETA: 7:54 - loss: 0.6827 78/157 [=============>................] - ETA: 7:46 - loss: 0.6826 79/157 [==============>...............] - ETA: 7:40 - loss: 0.6824 80/157 [==============>...............] - ETA: 7:33 - loss: 0.6825 81/157 [==============>...............] - ETA: 7:26 - loss: 0.6823 82/157 [==============>...............] - ETA: 7:21 - loss: 0.6820 83/157 [==============>...............] - ETA: 7:15 - loss: 0.6819 84/157 [===============>..............] - ETA: 7:08 - loss: 0.6819 85/157 [===============>..............] - ETA: 7:03 - loss: 0.6819 86/157 [===============>..............] - ETA: 6:57 - loss: 0.6817 87/157 [===============>..............] - ETA: 6:50 - loss: 0.6815 88/157 [===============>..............] - ETA: 6:43 - loss: 0.6813 89/157 [================>.............] - ETA: 6:38 - loss: 0.6811 90/157 [================>.............] - ETA: 6:32 - loss: 0.6812 91/157 [================>.............] - ETA: 6:25 - loss: 0.6811 92/157 [================>.............] - ETA: 6:19 - loss: 0.6811 93/157 [================>.............] - ETA: 6:13 - loss: 0.6810 94/157 [================>.............] - ETA: 6:07 - loss: 0.6808 95/157 [=================>............] - ETA: 6:03 - loss: 0.6806 96/157 [=================>............] - ETA: 5:59 - loss: 0.6805 97/157 [=================>............] - ETA: 5:53 - loss: 0.6803 98/157 [=================>............] - ETA: 5:47 - loss: 0.6803 99/157 [=================>............] - ETA: 5:41 - loss: 0.6803100/157 [==================>...........] - ETA: 5:37 - loss: 0.6803101/157 [==================>...........] - ETA: 5:33 - loss: 0.6801102/157 [==================>...........] - ETA: 5:30 - loss: 0.6801103/157 [==================>...........] - ETA: 5:25 - loss: 0.6799104/157 [==================>...........] - ETA: 5:20 - loss: 0.6800105/157 [===================>..........] - ETA: 5:15 - loss: 0.6799106/157 [===================>..........] - ETA: 5:12 - loss: 0.6800107/157 [===================>..........] - ETA: 5:09 - loss: 0.6801108/157 [===================>..........] - ETA: 5:05 - loss: 0.6799109/157 [===================>..........] - ETA: 4:59 - loss: 0.6798110/157 [====================>.........] - ETA: 4:52 - loss: 0.6798111/157 [====================>.........] - ETA: 4:46 - loss: 0.6796112/157 [====================>.........] - ETA: 4:40 - loss: 0.6795113/157 [====================>.........] - ETA: 4:35 - loss: 0.6795114/157 [====================>.........] - ETA: 4:29 - loss: 0.6794115/157 [====================>.........] - ETA: 4:25 - loss: 0.6794116/157 [=====================>........] - ETA: 4:20 - loss: 0.6792117/157 [=====================>........] - ETA: 4:16 - loss: 0.6793118/157 [=====================>........] - ETA: 4:12 - loss: 0.6793119/157 [=====================>........] - ETA: 4:09 - loss: 0.6793120/157 [=====================>........] - ETA: 4:04 - loss: 0.6793121/157 [======================>.......] - ETA: 3:57 - loss: 0.6792122/157 [======================>.......] - ETA: 3:50 - loss: 0.6792123/157 [======================>.......] - ETA: 3:43 - loss: 0.6791124/157 [======================>.......] - ETA: 3:37 - loss: 0.6790125/157 [======================>.......] - ETA: 3:30 - loss: 0.6789126/157 [=======================>......] - ETA: 3:23 - loss: 0.6788127/157 [=======================>......] - ETA: 3:17 - loss: 0.6787128/157 [=======================>......] - ETA: 3:10 - loss: 0.6785129/157 [=======================>......] - ETA: 3:03 - loss: 0.6783130/157 [=======================>......] - ETA: 2:56 - loss: 0.6782131/157 [========================>.....] - ETA: 2:49 - loss: 0.6783132/157 [========================>.....] - ETA: 2:43 - loss: 0.6783133/157 [========================>.....] - ETA: 2:37 - loss: 0.6782134/157 [========================>.....] - ETA: 2:30 - loss: 0.6782135/157 [========================>.....] - ETA: 2:24 - loss: 0.6781136/157 [========================>.....] - ETA: 2:17 - loss: 0.6781137/157 [=========================>....] - ETA: 2:11 - loss: 0.6781138/157 [=========================>....] - ETA: 2:04 - loss: 0.6780139/157 [=========================>....] - ETA: 1:58 - loss: 0.6779140/157 [=========================>....] - ETA: 1:51 - loss: 0.6778141/157 [=========================>....] - ETA: 1:44 - loss: 0.6779142/157 [==========================>...] - ETA: 1:38 - loss: 0.6778143/157 [==========================>...] - ETA: 1:32 - loss: 0.6778144/157 [==========================>...] - ETA: 1:25 - loss: 0.6778145/157 [==========================>...] - ETA: 1:18 - loss: 0.6777146/157 [==========================>...] - ETA: 1:12 - loss: 0.6775147/157 [===========================>..] - ETA: 1:05 - loss: 0.6775148/157 [===========================>..] - ETA: 59s - loss: 0.6776 149/157 [===========================>..] - ETA: 52s - loss: 0.6775150/157 [===========================>..] - ETA: 45s - loss: 0.6774151/157 [===========================>..] - ETA: 39s - loss: 0.6773152/157 [============================>.] - ETA: 32s - loss: 0.6773153/157 [============================>.] - ETA: 26s - loss: 0.6772154/157 [============================>.] - ETA: 19s - loss: 0.6771155/157 [============================>.] - ETA: 13s - loss: 0.6770156/157 [============================>.] - ETA: 6s - loss: 0.6769 157/157 [==============================] - ETA: 0s - loss: 0.6769157/157 [==============================] - 1080s 7s/step - loss: 0.6769 - val_loss: 0.6686
Epoch 2/20
  1/157 [..............................] - ETA: 0s - loss: 0.6662  2/157 [..............................] - ETA: 6:42 - loss: 0.6625  3/157 [..............................] - ETA: 10:07 - loss: 0.6713  4/157 [..............................] - ETA: 11:15 - loss: 0.6670  5/157 [..............................] - ETA: 12:05 - loss: 0.6684  6/157 [>.............................] - ETA: 12:30 - loss: 0.6701  7/157 [>.............................] - ETA: 12:12 - loss: 0.6692  8/157 [>.............................] - ETA: 12:13 - loss: 0.6699  9/157 [>.............................] - ETA: 12:06 - loss: 0.6684 10/157 [>.............................] - ETA: 13:12 - loss: 0.6691 11/157 [=>............................] - ETA: 13:52 - loss: 0.6685 12/157 [=>............................] - ETA: 13:49 - loss: 0.6687 13/157 [=>............................] - ETA: 13:40 - loss: 0.6695 14/157 [=>............................] - ETA: 13:41 - loss: 0.6693 15/157 [=>............................] - ETA: 13:35 - loss: 0.6696 16/157 [==>...........................] - ETA: 14:02 - loss: 0.6690 17/157 [==>...........................] - ETA: 14:17 - loss: 0.6682 18/157 [==>...........................] - ETA: 14:24 - loss: 0.6678 19/157 [==>...........................] - ETA: 14:07 - loss: 0.6680 20/157 [==>...........................] - ETA: 13:58 - loss: 0.6682 21/157 [===>..........................] - ETA: 14:46 - loss: 0.6683 22/157 [===>..........................] - ETA: 15:40 - loss: 0.6681 23/157 [===>..........................] - ETA: 16:05 - loss: 0.6679 24/157 [===>..........................] - ETA: 16:16 - loss: 0.6683 25/157 [===>..........................] - ETA: 16:23 - loss: 0.6680 26/157 [===>..........................] - ETA: 16:28 - loss: 0.6684 27/157 [====>.........................] - ETA: 16:26 - loss: 0.6688 28/157 [====>.........................] - ETA: 16:17 - loss: 0.6685 29/157 [====>.........................] - ETA: 16:05 - loss: 0.6691 30/157 [====>.........................] - ETA: 16:10 - loss: 0.6692 31/157 [====>.........................] - ETA: 16:05 - loss: 0.6689 32/157 [=====>........................] - ETA: 15:50 - loss: 0.6689 33/157 [=====>........................] - ETA: 15:27 - loss: 0.6688 34/157 [=====>........................] - ETA: 15:11 - loss: 0.6688 35/157 [=====>........................] - ETA: 14:54 - loss: 0.6687 36/157 [=====>........................] - ETA: 14:49 - loss: 0.6685 37/157 [======>.......................] - ETA: 14:35 - loss: 0.6686 38/157 [======>.......................] - ETA: 14:15 - loss: 0.6688 39/157 [======>.......................] - ETA: 13:55 - loss: 0.6690 40/157 [======>.......................] - ETA: 13:40 - loss: 0.6688 41/157 [======>.......................] - ETA: 13:28 - loss: 0.6689 42/157 [=======>......................] - ETA: 13:20 - loss: 0.6691 43/157 [=======>......................] - ETA: 13:15 - loss: 0.6693 44/157 [=======>......................] - ETA: 13:06 - loss: 0.6693 45/157 [=======>......................] - ETA: 12:55 - loss: 0.6691 46/157 [=======>......................] - ETA: 12:45 - loss: 0.6694 47/157 [=======>......................] - ETA: 12:37 - loss: 0.6695 48/157 [========>.....................] - ETA: 12:29 - loss: 0.6698 49/157 [========>.....................] - ETA: 12:19 - loss: 0.6699 50/157 [========>.....................] - ETA: 12:08 - loss: 0.6700 51/157 [========>.....................] - ETA: 12:02 - loss: 0.6699 52/157 [========>.....................] - ETA: 11:53 - loss: 0.6696 53/157 [=========>....................] - ETA: 11:49 - loss: 0.6694 54/157 [=========>....................] - ETA: 11:39 - loss: 0.6692 55/157 [=========>....................] - ETA: 11:31 - loss: 0.6693 56/157 [=========>....................] - ETA: 11:22 - loss: 0.6691 57/157 [=========>....................] - ETA: 11:22 - loss: 0.6693 58/157 [==========>...................] - ETA: 11:16 - loss: 0.6698 59/157 [==========>...................] - ETA: 11:10 - loss: 0.6699