Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking (Masking)            (None, 80, 6)             0         
_________________________________________________________________
lstm (LSTM)                  (None, 50)                11400     
_________________________________________________________________
dense (Dense)                (None, 16)                816       
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 12,233
Trainable params: 12,233
Non-trainable params: 0
_________________________________________________________________

Epoch 1/20
  1/157 [..............................] - ETA: 0s - loss: 0.6968  2/157 [..............................] - ETA: 5:48 - loss: 0.6934  3/157 [..............................] - ETA: 8:20 - loss: 0.6932  4/157 [..............................] - ETA: 10:00 - loss: 0.6939  5/157 [..............................] - ETA: 10:22 - loss: 0.6939  6/157 [>.............................] - ETA: 11:37 - loss: 0.6945  7/157 [>.............................] - ETA: 12:48 - loss: 0.6944  8/157 [>.............................] - ETA: 13:25 - loss: 0.6942  9/157 [>.............................] - ETA: 13:34 - loss: 0.6942 10/157 [>.............................] - ETA: 13:27 - loss: 0.6942 11/157 [=>............................] - ETA: 13:22 - loss: 0.6940 12/157 [=>............................] - ETA: 13:22 - loss: 0.6937 13/157 [=>............................] - ETA: 14:12 - loss: 0.6935 14/157 [=>............................] - ETA: 14:05 - loss: 0.6935 15/157 [=>............................] - ETA: 13:43 - loss: 0.6934 16/157 [==>...........................] - ETA: 13:29 - loss: 0.6935 17/157 [==>...........................] - ETA: 13:23 - loss: 0.6931 18/157 [==>...........................] - ETA: 13:11 - loss: 0.6929 19/157 [==>...........................] - ETA: 12:54 - loss: 0.6927 20/157 [==>...........................] - ETA: 12:57 - loss: 0.6924 21/157 [===>..........................] - ETA: 13:09 - loss: 0.6923 22/157 [===>..........................] - ETA: 13:33 - loss: 0.6923 23/157 [===>..........................] - ETA: 13:20 - loss: 0.6923 24/157 [===>..........................] - ETA: 13:04 - loss: 0.6923 25/157 [===>..........................] - ETA: 13:01 - loss: 0.6920 26/157 [===>..........................] - ETA: 12:58 - loss: 0.6919 27/157 [====>.........................] - ETA: 12:58 - loss: 0.6917 28/157 [====>.........................] - ETA: 13:18 - loss: 0.6915 29/157 [====>.........................] - ETA: 13:13 - loss: 0.6914 30/157 [====>.........................] - ETA: 13:04 - loss: 0.6913 31/157 [====>.........................] - ETA: 12:54 - loss: 0.6909 32/157 [=====>........................] - ETA: 12:37 - loss: 0.6908 33/157 [=====>........................] - ETA: 12:25 - loss: 0.6905 34/157 [=====>........................] - ETA: 12:14 - loss: 0.6903 35/157 [=====>........................] - ETA: 12:01 - loss: 0.6901 36/157 [=====>........................] - ETA: 11:45 - loss: 0.6900 37/157 [======>.......................] - ETA: 11:37 - loss: 0.6897 38/157 [======>.......................] - ETA: 11:34 - loss: 0.6895 39/157 [======>.......................] - ETA: 11:39 - loss: 0.6896 40/157 [======>.......................] - ETA: 11:36 - loss: 0.6891 41/157 [======>.......................] - ETA: 11:30 - loss: 0.6888 42/157 [=======>......................] - ETA: 11:21 - loss: 0.6888 43/157 [=======>......................] - ETA: 11:08 - loss: 0.6887 44/157 [=======>......................] - ETA: 10:59 - loss: 0.6882 45/157 [=======>......................] - ETA: 10:54 - loss: 0.6881 46/157 [=======>......................] - ETA: 10:48 - loss: 0.6878 47/157 [=======>......................] - ETA: 10:40 - loss: 0.6878 48/157 [========>.....................] - ETA: 10:33 - loss: 0.6877 49/157 [========>.....................] - ETA: 10:33 - loss: 0.6876 50/157 [========>.....................] - ETA: 10:28 - loss: 0.6872 51/157 [========>.....................] - ETA: 10:25 - loss: 0.6870 52/157 [========>.....................] - ETA: 10:20 - loss: 0.6868 53/157 [=========>....................] - ETA: 10:16 - loss: 0.6864 54/157 [=========>....................] - ETA: 10:08 - loss: 0.6862 55/157 [=========>....................] - ETA: 10:02 - loss: 0.6858 56/157 [=========>....................] - ETA: 9:56 - loss: 0.6856  57/157 [=========>....................] - ETA: 9:50 - loss: 0.6855 58/157 [==========>...................] - ETA: 9:43 - loss: 0.6854 59/157 [==========>...................] - ETA: 9:34 - loss: 0.6852 60/157 [==========>...................] - ETA: 9:25 - loss: 0.6852 61/157 [==========>...................] - ETA: 9:16 - loss: 0.6849 62/157 [==========>...................] - ETA: 9:09 - loss: 0.6848 63/157 [===========>..................] - ETA: 9:03 - loss: 0.6848 64/157 [===========>..................] - ETA: 8:57 - loss: 0.6844 65/157 [===========>..................] - ETA: 8:49 - loss: 0.6843 66/157 [===========>..................] - ETA: 8:42 - loss: 0.6843 67/157 [===========>..................] - ETA: 8:37 - loss: 0.6845 68/157 [===========>..................] - ETA: 8:32 - loss: 0.6842 69/157 [============>.................] - ETA: 8:25 - loss: 0.6842 70/157 [============>.................] - ETA: 8:23 - loss: 0.6843 71/157 [============>.................] - ETA: 8:20 - loss: 0.6842 72/157 [============>.................] - ETA: 8:16 - loss: 0.6840 73/157 [============>.................] - ETA: 8:14 - loss: 0.6838 74/157 [=============>................] - ETA: 8:10 - loss: 0.6837 75/157 [=============>................] - ETA: 8:03 - loss: 0.6836 76/157 [=============>................] - ETA: 7:59 - loss: 0.6835 77/157 [=============>................] - ETA: 7:54 - loss: 0.6832 78/157 [=============>................] - ETA: 7:47 - loss: 0.6830 79/157 [==============>...............] - ETA: 7:41 - loss: 0.6831 80/157 [==============>...............] - ETA: 7:32 - loss: 0.6831 81/157 [==============>...............] - ETA: 7:26 - loss: 0.6830 82/157 [==============>...............] - ETA: 7:21 - loss: 0.6829 83/157 [==============>...............] - ETA: 7:16 - loss: 0.6828 84/157 [===============>..............] - ETA: 7:12 - loss: 0.6827 85/157 [===============>..............] - ETA: 7:05 - loss: 0.6826 86/157 [===============>..............] - ETA: 6:59 - loss: 0.6826 87/157 [===============>..............] - ETA: 6:51 - loss: 0.6824 88/157 [===============>..............] - ETA: 6:44 - loss: 0.6821 89/157 [================>.............] - ETA: 6:37 - loss: 0.6820 90/157 [================>.............] - ETA: 6:30 - loss: 0.6818 91/157 [================>.............] - ETA: 6:24 - loss: 0.6816 92/157 [================>.............] - ETA: 6:17 - loss: 0.6816 93/157 [================>.............] - ETA: 6:09 - loss: 0.6817 94/157 [================>.............] - ETA: 6:02 - loss: 0.6816 95/157 [=================>............] - ETA: 5:55 - loss: 0.6815 96/157 [=================>............] - ETA: 5:49 - loss: 0.6813 97/157 [=================>............] - ETA: 5:43 - loss: 0.6812 98/157 [=================>............] - ETA: 5:36 - loss: 0.6809 99/157 [=================>............] - ETA: 5:30 - loss: 0.6808100/157 [==================>...........] - ETA: 5:24 - loss: 0.6809101/157 [==================>...........] - ETA: 5:18 - loss: 0.6807102/157 [==================>...........] - ETA: 5:12 - loss: 0.6807103/157 [==================>...........] - ETA: 5:06 - loss: 0.6806104/157 [==================>...........] - ETA: 5:00 - loss: 0.6805105/157 [===================>..........] - ETA: 4:54 - loss: 0.6806106/157 [===================>..........] - ETA: 4:50 - loss: 0.6805107/157 [===================>..........] - ETA: 4:46 - loss: 0.6803108/157 [===================>..........] - ETA: 4:40 - loss: 0.6803109/157 [===================>..........] - ETA: 4:34 - loss: 0.6802110/157 [====================>.........] - ETA: 4:29 - loss: 0.6801111/157 [====================>.........] - ETA: 4:24 - loss: 0.6801112/157 [====================>.........] - ETA: 4:20 - loss: 0.6799113/157 [====================>.........] - ETA: 4:15 - loss: 0.6798114/157 [====================>.........] - ETA: 4:10 - loss: 0.6799115/157 [====================>.........] - ETA: 4:07 - loss: 0.6798116/157 [=====================>........] - ETA: 4:01 - loss: 0.6797117/157 [=====================>........] - ETA: 3:55 - loss: 0.6797118/157 [=====================>........] - ETA: 3:50 - loss: 0.6797119/157 [=====================>........] - ETA: 3:44 - loss: 0.6796120/157 [=====================>........] - ETA: 3:38 - loss: 0.6797121/157 [======================>.......] - ETA: 3:33 - loss: 0.6797122/157 [======================>.......] - ETA: 3:27 - loss: 0.6796123/157 [======================>.......] - ETA: 3:22 - loss: 0.6795124/157 [======================>.......] - ETA: 3:16 - loss: 0.6796125/157 [======================>.......] - ETA: 3:09 - loss: 0.6795126/157 [=======================>......] - ETA: 3:03 - loss: 0.6794127/157 [=======================>......] - ETA: 2:57 - loss: 0.6795128/157 [=======================>......] - ETA: 2:52 - loss: 0.6794129/157 [=======================>......] - ETA: 2:46 - loss: 0.6794130/157 [=======================>......] - ETA: 2:41 - loss: 0.6793131/157 [========================>.....] - ETA: 2:36 - loss: 0.6793132/157 [========================>.....] - ETA: 2:30 - loss: 0.6793133/157 [========================>.....] - ETA: 2:24 - loss: 0.6792134/157 [========================>.....] - ETA: 2:18 - loss: 0.6792135/157 [========================>.....] - ETA: 2:12 - loss: 0.6792136/157 [========================>.....] - ETA: 2:06 - loss: 0.6791137/157 [=========================>....] - ETA: 2:00 - loss: 0.6791138/157 [=========================>....] - ETA: 1:54 - loss: 0.6791139/157 [=========================>....] - ETA: 1:48 - loss: 0.6790140/157 [=========================>....] - ETA: 1:42 - loss: 0.6790141/157 [=========================>....] - ETA: 1:36 - loss: 0.6789142/157 [==========================>...] - ETA: 1:30 - loss: 0.6789143/157 [==========================>...] - ETA: 1:23 - loss: 0.6789144/157 [==========================>...] - ETA: 1:17 - loss: 0.6790145/157 [==========================>...] - ETA: 1:11 - loss: 0.6789146/157 [==========================>...] - ETA: 1:05 - loss: 0.6788147/157 [===========================>..] - ETA: 59s - loss: 0.6788 148/157 [===========================>..] - ETA: 53s - loss: 0.6787149/157 [===========================>..] - ETA: 47s - loss: 0.6786150/157 [===========================>..] - ETA: 42s - loss: 0.6786151/157 [===========================>..] - ETA: 36s - loss: 0.6786152/157 [============================>.] - ETA: 30s - loss: 0.6785153/157 [============================>.] - ETA: 24s - loss: 0.6784154/157 [============================>.] - ETA: 18s - loss: 0.6783155/157 [============================>.] - ETA: 12s - loss: 0.6783156/157 [============================>.] - ETA: 6s - loss: 0.6781 157/157 [==============================] - ETA: 0s - loss: 0.6781157/157 [==============================] - 1005s 6s/step - loss: 0.6781 - val_loss: 0.6674
Epoch 2/20
  1/157 [..............................] - ETA: 0s - loss: 0.6693  2/157 [..............................] - ETA: 9:31 - loss: 0.6675  3/157 [..............................] - ETA: 14:40 - loss: 0.6704  4/157 [..............................] - ETA: 18:11 - loss: 0.6794  5/157 [..............................] - ETA: 17:43 - loss: 0.6783  6/157 [>.............................] - ETA: 17:14 - loss: 0.6782  7/157 [>.............................] - ETA: 17:48 - loss: 0.6760  8/157 [>.............................] - ETA: 16:48 - loss: 0.6764  9/157 [>.............................] - ETA: 16:12 - loss: 0.6741 10/157 [>.............................] - ETA: 17:24 - loss: 0.6705 11/157 [=>............................] - ETA: 16:50 - loss: 0.6710 12/157 [=>............................] - ETA: 16:46 - loss: 0.6710 13/157 [=>............................] - ETA: 16:29 - loss: 0.6721 14/157 [=>............................] - ETA: 16:03 - loss: 0.6726 15/157 [=>............................] - ETA: 15:49 - loss: 0.6725 16/157 [==>...........................] - ETA: 15:39 - loss: 0.6722 17/157 [==>...........................] - ETA: 15:43 - loss: 0.6732 18/157 [==>...........................] - ETA: 16:04 - loss: 0.6739 19/157 [==>...........................] - ETA: 15:54 - loss: 0.6741 20/157 [==>...........................] - ETA: 15:20 - loss: 0.6738 21/157 [===>..........................] - ETA: 14:55 - loss: 0.6737 22/157 [===>..........................] - ETA: 14:41 - loss: 0.6733 23/157 [===>..........................] - ETA: 14:35 - loss: 0.6732 24/157 [===>..........................] - ETA: 14:25 - loss: 0.6725 25/157 [===>..........................] - ETA: 14:22 - loss: 0.6721 26/157 [===>..........................] - ETA: 14:10 - loss: 0.6713 27/157 [====>.........................] - ETA: 13:54 - loss: 0.6713 28/157 [====>.........................] - ETA: 13:48 - loss: 0.6712 29/157 [====>.........................] - ETA: 13:36 - loss: 0.6713 30/157 [====>.........................] - ETA: 13:21 - loss: 0.6715 31/157 [====>.........................] - ETA: 13:09 - loss: 0.6715 32/157 [=====>........................] - ETA: 13:04 - loss: 0.6711 33/157 [=====>........................] - ETA: 12:56 - loss: 0.6707 34/157 [=====>........................] - ETA: 12:55 - loss: 0.6707 35/157 [=====>........................] - ETA: 12:53 - loss: 0.6707 36/157 [=====>........................] - ETA: 12:46 - loss: 0.6704 37/157 [======>.......................] - ETA: 12:47 - loss: 0.6704 38/157 [======>.......................] - ETA: 12:41 - loss: 0.6709 39/157 [======>.......................] - ETA: 12:47 - loss: 0.6707 40/157 [======>.......................] - ETA: 12:44 - loss: 0.6708 41/157 [======>.......................] - ETA: 12:36 - loss: 0.6708 42/157 [=======>......................] - ETA: 12:28 - loss: 0.6708 43/157 [=======>......................] - ETA: 12:19 - loss: 0.6703 44/157 [=======>......................] - ETA: 12:25 - loss: 0.6705 45/157 [=======>......................] - ETA: 12:28 - loss: 0.6706 46/157 [=======>......................] - ETA: 12:19 - loss: 0.6708 47/157 [=======>......................] - ETA: 12:09 - loss: 0.6707 48/157 [========>.....................] - ETA: 11:59 - loss: 0.6708 49/157 [========>.....................] - ETA: 11:50 - loss: 0.6710 50/157 [========>.....................] - ETA: 11:39 - loss: 0.6711 51/157 [========>.....................] - ETA: 11:31 - loss: 0.6709 52/157 [========>.....................] - ETA: 11:19 - loss: 0.6709 53/157 [=========>....................] - ETA: 11:08 - loss: 0.6709 54/157 [=========>....................] - ETA: 10:57 - loss: 0.6710 55/157 [=========>....................] - ETA: 10:49 - loss: 0.6710 56/157 [=========>....................] - ETA: 10:40 - loss: 0.6710 57/157 [=========>....................] - ETA: 10:35 - loss: 0.6708 58/157 [==========>...................] - ETA: 10:26 - loss: 0.6704 59/157 [==========>...................] - ETA: 10:17 - loss: 0.6702 60/157 [==========>...................] - ETA: 10:07 - loss: 0.6702 61/157 [==========>...................] - ETA: 9:59 - loss: 0.6700  62/157 [==========>...................] - ETA: 9:50 - loss: 0.6703 63/157 [===========>..................] - ETA: 9:45 - loss: 0.6702 64/157 [===========>..................] - ETA: 9:43 - loss: 0.6702 65/157 [===========>..................] - ETA: 9:35 - loss: 0.6702 66/157 [===========>..................] - ETA: 9:26 - loss: 0.6703 67/157 [===========>..................] - ETA: 9:18 - loss: 0.6704 68/157 [===========>..................] - ETA: 9:13 - loss: 0.6705 69/157 [============>.................] - ETA: 9:13 - loss: 0.6704 70/157 [============>.................] - ETA: 9:13 - loss: 0.6704 71/157 [============>.................] - ETA: 9:11 - loss: 0.6706 72/157 [============>.................] - ETA: 9:08 - loss: 0.6704 73/157 [============>.................] - ETA: 9:06 - loss: 0.6704