Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking (Masking)            (None, 80, 6)             0         
_________________________________________________________________
lstm (LSTM)                  (None, 50)                11400     
_________________________________________________________________
dense (Dense)                (None, 16)                816       
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 12,233
Trainable params: 12,233
Non-trainable params: 0
_________________________________________________________________

Epoch 1/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69412/7 [=======>......................] - ETA: 6s - loss: 0.69593/7 [===========>..................] - ETA: 6s - loss: 0.69534/7 [================>.............] - ETA: 6s - loss: 0.69555/7 [====================>.........] - ETA: 4s - loss: 0.69556/7 [========================>.....] - ETA: 2s - loss: 0.69547/7 [==============================] - ETA: 0s - loss: 0.69527/7 [==============================] - 17s 2s/step - loss: 0.6952 - val_loss: 0.6926
Epoch 2/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69052/7 [=======>......................] - ETA: 2s - loss: 0.69233/7 [===========>..................] - ETA: 2s - loss: 0.69164/7 [================>.............] - ETA: 3s - loss: 0.69135/7 [====================>.........] - ETA: 2s - loss: 0.69136/7 [========================>.....] - ETA: 1s - loss: 0.69197/7 [==============================] - ETA: 0s - loss: 0.69187/7 [==============================] - 13s 2s/step - loss: 0.6918 - val_loss: 0.6914
Epoch 3/3
1/7 [===>..........................] - ETA: 0s - loss: 0.68572/7 [=======>......................] - ETA: 2s - loss: 0.68853/7 [===========>..................] - ETA: 2s - loss: 0.68944/7 [================>.............] - ETA: 2s - loss: 0.69065/7 [====================>.........] - ETA: 2s - loss: 0.69006/7 [========================>.....] - ETA: 1s - loss: 0.68957/7 [==============================] - ETA: 0s - loss: 0.68957/7 [==============================] - 13s 2s/step - loss: 0.6895 - val_loss: 0.6907
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking_1 (Masking)          (None, 80, 6)             0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 50)                11400     
_________________________________________________________________
dense_2 (Dense)              (None, 16)                816       
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 17        
=================================================================
Total params: 12,233
Trainable params: 12,233
Non-trainable params: 0
_________________________________________________________________

Epoch 1/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69592/7 [=======>......................] - ETA: 3s - loss: 0.69533/7 [===========>..................] - ETA: 3s - loss: 0.69484/7 [================>.............] - ETA: 2s - loss: 0.69435/7 [====================>.........] - ETA: 2s - loss: 0.69386/7 [========================>.....] - ETA: 1s - loss: 0.69297/7 [==============================] - ETA: 0s - loss: 0.69297/7 [==============================] - 13s 2s/step - loss: 0.6929 - val_loss: 0.6945
Epoch 2/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69302/7 [=======>......................] - ETA: 3s - loss: 0.69093/7 [===========>..................] - ETA: 3s - loss: 0.69124/7 [================>.............] - ETA: 2s - loss: 0.68875/7 [====================>.........] - ETA: 1s - loss: 0.68986/7 [========================>.....] - ETA: 1s - loss: 0.68917/7 [==============================] - ETA: 0s - loss: 0.68887/7 [==============================] - 12s 2s/step - loss: 0.6888 - val_loss: 0.6913
Epoch 3/3
1/7 [===>..........................] - ETA: 0s - loss: 0.68522/7 [=======>......................] - ETA: 4s - loss: 0.68433/7 [===========>..................] - ETA: 5s - loss: 0.68484/7 [================>.............] - ETA: 4s - loss: 0.68445/7 [====================>.........] - ETA: 2s - loss: 0.68586/7 [========================>.....] - ETA: 1s - loss: 0.68537/7 [==============================] - ETA: 0s - loss: 0.68457/7 [==============================] - 11s 2s/step - loss: 0.6845 - val_loss: 0.6880
