Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking (Masking)            (None, 80, 6)             0         
_________________________________________________________________
lstm (LSTM)                  (None, 50)                11400     
_________________________________________________________________
dense (Dense)                (None, 16)                816       
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 12,233
Trainable params: 12,233
Non-trainable params: 0
_________________________________________________________________

Epoch 1/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69112/7 [=======>......................] - ETA: 6s - loss: 0.69433/7 [===========>..................] - ETA: 6s - loss: 0.69644/7 [================>.............] - ETA: 4s - loss: 0.69635/7 [====================>.........] - ETA: 3s - loss: 0.69586/7 [========================>.....] - ETA: 1s - loss: 0.69557/7 [==============================] - ETA: 0s - loss: 0.69567/7 [==============================] - 16s 2s/step - loss: 0.6956 - val_loss: 0.6940
Epoch 2/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69202/7 [=======>......................] - ETA: 4s - loss: 0.69443/7 [===========>..................] - ETA: 4s - loss: 0.69244/7 [================>.............] - ETA: 3s - loss: 0.69125/7 [====================>.........] - ETA: 2s - loss: 0.69276/7 [========================>.....] - ETA: 1s - loss: 0.69257/7 [==============================] - ETA: 0s - loss: 0.69267/7 [==============================] - 12s 2s/step - loss: 0.6926 - val_loss: 0.6915
Epoch 3/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69012/7 [=======>......................] - ETA: 5s - loss: 0.68953/7 [===========>..................] - ETA: 5s - loss: 0.68974/7 [================>.............] - ETA: 4s - loss: 0.69005/7 [====================>.........] - ETA: 3s - loss: 0.69026/7 [========================>.....] - ETA: 1s - loss: 0.69047/7 [==============================] - ETA: 0s - loss: 0.69047/7 [==============================] - 18s 3s/step - loss: 0.6904 - val_loss: 0.6905
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
masking_1 (Masking)          (None, 80, 6)             0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 50)                11400     
_________________________________________________________________
dense_2 (Dense)              (None, 16)                816       
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 17        
=================================================================
Total params: 12,233
Trainable params: 12,233
Non-trainable params: 0
_________________________________________________________________

Epoch 1/3
1/7 [===>..........................] - ETA: 0s - loss: 0.70402/7 [=======>......................] - ETA: 4s - loss: 0.70053/7 [===========>..................] - ETA: 3s - loss: 0.69924/7 [================>.............] - ETA: 2s - loss: 0.69815/7 [====================>.........] - ETA: 1s - loss: 0.69776/7 [========================>.....] - ETA: 1s - loss: 0.69707/7 [==============================] - ETA: 0s - loss: 0.69697/7 [==============================] - 12s 2s/step - loss: 0.6969 - val_loss: 0.6903
Epoch 2/3
1/7 [===>..........................] - ETA: 0s - loss: 0.69252/7 [=======>......................] - ETA: 3s - loss: 0.69153/7 [===========>..................] - ETA: 4s - loss: 0.69214/7 [================>.............] - ETA: 3s - loss: 0.69135/7 [====================>.........] - ETA: 3s - loss: 0.69086/7 [========================>.....] - ETA: 1s - loss: 0.69057/7 [==============================] - ETA: 0s - loss: 0.69027/7 [==============================] - 16s 2s/step - loss: 0.6902 - val_loss: 0.6890
Epoch 3/3
1/7 [===>..........................] - ETA: 0s - loss: 0.68952/7 [=======>......................] - ETA: 1s - loss: 0.68503/7 [===========>..................] - ETA: 2s - loss: 0.68684/7 [================>.............] - ETA: 2s - loss: 0.68705/7 [====================>.........] - ETA: 1s - loss: 0.68596/7 [========================>.....] - ETA: 0s - loss: 0.68777/7 [==============================] - ETA: 0s - loss: 0.68817/7 [==============================] - 9s 1s/step - loss: 0.6881 - val_loss: 0.6889
